using CDUniTap.Data.Paym;
using CDUniTap.Interfaces.Markers;
using CDUniTap.Services.Api;
using Spectre.Console;

namespace CDUniTap.Cli;

public class PaymCliCommander : ICliCommander
{
    private readonly PaymServiceApi _paymServiceApi;
    private bool _authenticated = false;
    private List<ProjectDto>? _projects;


    private Dictionary<int, Dictionary<string, int>> _areasSubArea =
        new()
        {
            {
                0, new Dictionary<string, int>
                   {
                       { "榕树园5", 0 },
                       { "榕树园6", 1 },
                       { "榕树园7", 2 },
                       { "榕树园8", 3 },
                       { "榕树园9", 4 },
                       { "榕树园10", 5 },
                       { "榕树园11", 6 },
                       { "榕树园12", 7 },
                   }
            },
            {
                1, new Dictionary<string, int>
                   {
                       { "珙桐园1", 0 },
                       { "珙桐园2", 1 },
                       { "珙桐园3", 2 },
                       { "珙桐园4", 3 },
                       { "珙桐园5", 4 },
                       { "珙桐园6", 5 },
                       { "珙桐园7", 6 },
                   }
            },
            {
                2, new Dictionary<string, int>()
                   {
                       { "松林园1", 0 },
                       { "松林园2", 1 },
                   }
            },
            {
                3, new Dictionary<string, int>()
                   {
                       { "银杏园1", 0 },
                       { "银杏园2", 1 },
                       { "银杏园3", 2 },
                       { "银杏园4", 3 },
                   }
            },
            {
                4, new Dictionary<string, int>()
                   {
                       { "芙蓉园1", 0 },
                       { "芙蓉园2", 1 },
                       { "芙蓉园3", 2 },
                       { "芙蓉园4", 3 },
                       { "芙蓉园5", 4 },
                       { "芙蓉园6", 5 },
                       { "芙蓉园7", 6 },
                       { "芙蓉园8", 7 },
                       { "芙蓉园9", 8 }
                   }
            },
            {
                5, new()
                   {
                       { "香樟园1", 0 },
                       { "香樟园2", 1 },
                       { "香樟园3", 2 },
                       { "香樟园4", 3 },
                       { "香樟园5", 4 },
                       { "香樟园6", 5 },
                   }
            }
        };


    public PaymCliCommander(PaymServiceApi paymServiceApi)
    {
        _paymServiceApi = paymServiceApi;
    }

    public async Task EnterCommander()
    {
        if (!_authenticated) await Authenticate();
        if (!_authenticated) return;
        await GetUserInfo();
        await GetAllProjects();
        await AskPayChoice();
    }

    private Dictionary<string, string> _aldYxDomIdToRoomId = new Dictionary<string, string>()
                                                             {
                                                                 { "651", "1" }, { "110", "10" }, { "250", "100" },
                                                                 { "251", "101" }, { "301", "102" }, { "302", "103" },
                                                                 { "303", "104" }, { "304", "105" }, { "305", "106" },
                                                                 { "306", "107" }, { "307", "108" }, { "308", "109" },
                                                                 { "111", "11" }, { "309", "110" }, { "310", "111" },
                                                                 { "311", "112" }, { "312", "113" }, { "313", "114" },
                                                                 { "314", "115" }, { "315", "116" }, { "316", "117" },
                                                                 { "317", "118" }, { "318", "119" }, { "112", "12" },
                                                                 { "319", "120" }, { "320", "121" }, { "321", "122" },
                                                                 { "322", "123" }, { "323", "124" }, { "324", "125" },
                                                                 { "325", "126" }, { "326", "127" }, { "327", "128" },
                                                                 { "328", "129" }, { "113", "13" }, { "329", "130" },
                                                                 { "330", "131" }, { "331", "132" }, { "332", "133" },
                                                                 { "333", "134" }, { "334", "135" }, { "335", "136" },
                                                                 { "336", "137" }, { "337", "138" }, { "338", "139" },
                                                                 { "114", "14" }, { "339", "140" }, { "340", "141" },
                                                                 { "341", "142" }, { "342", "143" }, { "343", "144" },
                                                                 { "344", "145" }, { "345", "146" }, { "346", "147" },
                                                                 { "347", "148" }, { "348", "149" }, { "115", "15" },
                                                                 { "349", "150" }, { "350", "151" }, { "351", "152" },
                                                                 { "401", "153" }, { "402", "154" }, { "403", "155" },
                                                                 { "404", "156" }, { "405", "157" }, { "406", "158" },
                                                                 { "407", "159" }, { "116", "16" }, { "408", "160" },
                                                                 { "409", "161" }, { "410", "162" }, { "411", "163" },
                                                                 { "412", "164" }, { "413", "165" }, { "414", "166" },
                                                                 { "415", "167" }, { "416", "168" }, { "417", "169" },
                                                                 { "117", "17" }, { "418", "170" }, { "419", "171" },
                                                                 { "420", "172" }, { "421", "173" }, { "422", "174" },
                                                                 { "423", "175" }, { "424", "176" }, { "425", "177" },
                                                                 { "426", "178" }, { "427", "179" }, { "118", "18" },
                                                                 { "428", "180" }, { "429", "181" }, { "430", "182" },
                                                                 { "431", "183" }, { "432", "184" }, { "433", "185" },
                                                                 { "434", "186" }, { "435", "187" }, { "436", "188" },
                                                                 { "437", "189" }, { "119", "19" }, { "438", "190" },
                                                                 { "439", "191" }, { "440", "192" }, { "441", "193" },
                                                                 { "442", "194" }, { "443", "195" }, { "444", "196" },
                                                                 { "445", "197" }, { "446", "198" }, { "447", "199" },
                                                                 { "102", "2" }, { "120", "20" }, { "448", "200" },
                                                                 { "449", "201" }, { "450", "202" }, { "451", "203" },
                                                                 { "501", "204" }, { "502", "205" }, { "503", "206" },
                                                                 { "504", "207" }, { "505", "208" }, { "506", "209" },
                                                                 { "121", "21" }, { "507", "210" }, { "508", "211" },
                                                                 { "509", "212" }, { "510", "213" }, { "511", "214" },
                                                                 { "512", "215" }, { "513", "216" }, { "514", "217" },
                                                                 { "515", "218" }, { "516", "219" }, { "122", "22" },
                                                                 { "517", "220" }, { "518", "221" }, { "519", "222" },
                                                                 { "520", "223" }, { "521", "224" }, { "522", "225" },
                                                                 { "523", "226" }, { "524", "227" }, { "525", "228" },
                                                                 { "526", "229" }, { "123", "23" }, { "527", "230" },
                                                                 { "528", "231" }, { "529", "232" }, { "530", "233" },
                                                                 { "531", "234" }, { "532", "235" }, { "533", "236" },
                                                                 { "534", "237" }, { "535", "238" }, { "536", "239" },
                                                                 { "124", "24" }, { "537", "240" }, { "538", "241" },
                                                                 { "539", "242" }, { "540", "243" }, { "541", "244" },
                                                                 { "542", "245" }, { "543", "246" }, { "544", "247" },
                                                                 { "545", "248" }, { "546", "249" }, { "125", "25" },
                                                                 { "547", "250" }, { "548", "251" }, { "549", "252" },
                                                                 { "550", "253" }, { "551", "254" }, { "601", "255" },
                                                                 { "602", "256" }, { "603", "257" }, { "604", "258" },
                                                                 { "605", "259" }, { "126", "26" }, { "606", "260" },
                                                                 { "607", "261" }, { "608", "262" }, { "609", "263" },
                                                                 { "610", "264" }, { "611", "265" }, { "612", "266" },
                                                                 { "613", "267" }, { "614", "268" }, { "615", "269" },
                                                                 { "127", "27" }, { "616", "270" }, { "617", "271" },
                                                                 { "618", "272" }, { "619", "273" }, { "620", "274" },
                                                                 { "621", "275" }, { "622", "276" }, { "623", "277" },
                                                                 { "624", "278" }, { "625", "279" }, { "128", "28" },
                                                                 { "626", "280" }, { "627", "281" }, { "628", "282" },
                                                                 { "629", "283" }, { "630", "284" }, { "631", "285" },
                                                                 { "632", "286" }, { "633", "287" }, { "634", "288" },
                                                                 { "635", "289" }, { "129", "29" }, { "636", "290" },
                                                                 { "637", "291" }, { "638", "292" }, { "639", "293" },
                                                                 { "640", "294" }, { "641", "295" }, { "642", "296" },
                                                                 { "643", "297" }, { "644", "298" }, { "645", "299" },
                                                                 { "103", "3" }, { "130", "30" }, { "646", "300" },
                                                                 { "647", "301" }, { "648", "302" }, { "649", "303" },
                                                                 { "650", "304" }, { "131", "31" }, { "132", "32" },
                                                                 { "133", "33" }, { "134", "34" }, { "135", "35" },
                                                                 { "136", "36" }, { "137", "37" }, { "138", "38" },
                                                                 { "139", "39" }, { "104", "4" }, { "140", "40" },
                                                                 { "141", "41" }, { "142", "42" }, { "143", "43" },
                                                                 { "144", "44" }, { "145", "45" }, { "146", "46" },
                                                                 { "147", "47" }, { "148", "48" }, { "149", "49" },
                                                                 { "105", "5" }, { "150", "50" }, { "201", "51" },
                                                                 { "202", "52" }, { "203", "53" }, { "204", "54" },
                                                                 { "205", "55" }, { "206", "56" }, { "207", "57" },
                                                                 { "208", "58" }, { "209", "59" }, { "106", "6" },
                                                                 { "210", "60" }, { "211", "61" }, { "212", "62" },
                                                                 { "213", "63" }, { "214", "64" }, { "215", "65" },
                                                                 { "216", "66" }, { "217", "67" }, { "218", "68" },
                                                                 { "219", "69" }, { "107", "7" }, { "220", "70" },
                                                                 { "221", "71" }, { "222", "72" }, { "223", "73" },
                                                                 { "224", "74" }, { "225", "75" }, { "226", "76" },
                                                                 { "227", "77" }, { "228", "78" }, { "229", "79" },
                                                                 { "108", "8" }, { "230", "80" }, { "231", "81" },
                                                                 { "232", "82" }, { "233", "83" }, { "234", "84" },
                                                                 { "235", "85" }, { "236", "86" }, { "237", "87" },
                                                                 { "238", "88" }, { "239", "89" }, { "109", "9" },
                                                                 { "240", "90" }, { "241", "91" }, { "242", "92" },
                                                                 { "243", "93" }, { "244", "94" }, { "245", "95" },
                                                                 { "246", "96" }, { "247", "97" }, { "248", "98" },
                                                                 { "249", "99" },
                                                                 { "151", "305" }, { "152", "306" }, { "153", "307" },
                                                                 { "154", "308" }, { "155", "309" }, { "156", "310" },
                                                                 { "157", "311" }, { "158", "312" }, { "159", "313" },
                                                                 { "160", "314" }, { "161", "315" }, { "162", "316" },
                                                                 { "163", "317" }, { "164", "318" }, { "165", "319" },
                                                                 { "166", "320" }, { "167", "321" }, { "168", "322" },
                                                                 { "169", "323" }, { "170", "324" }, { "171", "325" },
                                                                 { "172", "326" }, { "173", "327" }, { "174", "328" },
                                                                 { "175", "329" }, { "252", "330" }, { "253", "331" },
                                                                 { "254", "332" }, { "255", "333" }, { "256", "334" },
                                                                 { "257", "335" }, { "258", "336" }, { "259", "337" },
                                                                 { "260", "338" }, { "261", "339" }, { "262", "340" },
                                                                 { "263", "341" }, { "264", "342" }, { "265", "343" },
                                                                 { "266", "344" }, { "267", "345" }, { "268", "346" },
                                                                 { "269", "347" }, { "270", "348" }, { "271", "349" },
                                                                 { "272", "350" }, { "273", "351" }, { "274", "352" },
                                                                 { "275", "353" }, { "276", "354" }, { "277", "355" },
                                                                 { "278", "356" }, { "352", "357" }, { "353", "358" },
                                                                 { "354", "359" }, { "355", "360" }, { "356", "361" },
                                                                 { "357", "362" }, { "358", "363" }, { "359", "364" },
                                                                 { "360", "365" }, { "361", "366" }, { "362", "367" },
                                                                 { "363", "368" }, { "364", "369" }, { "365", "370" },
                                                                 { "366", "371" }, { "367", "372" }, { "368", "373" },
                                                                 { "369", "374" }, { "370", "375" }, { "371", "376" },
                                                                 { "372", "377" }, { "373", "378" }, { "374", "379" },
                                                                 { "375", "380" }, { "376", "381" }, { "377", "382" },
                                                                 { "378", "383" }, { "452", "384" }, { "453", "385" },
                                                                 { "454", "386" }, { "455", "387" }, { "456", "388" },
                                                                 { "457", "389" }, { "458", "390" }, { "459", "391" },
                                                                 { "460", "392" }, { "461", "393" }, { "462", "394" },
                                                                 { "463", "395" }, { "464", "396" }, { "465", "397" },
                                                                 { "466", "398" }, { "467", "399" }, { "468", "400" },
                                                                 { "469", "401" }, { "470", "402" }, { "471", "403" },
                                                                 { "472", "404" }, { "473", "405" }, { "474", "406" },
                                                                 { "475", "407" }, { "476", "408" }, { "477", "409" },
                                                                 { "478", "410" }, { "552", "411" }, { "553", "412" },
                                                                 { "554", "413" }, { "555", "414" }, { "556", "415" },
                                                                 { "557", "416" }, { "558", "417" }, { "559", "418" },
                                                                 { "560", "419" }, { "561", "420" }, { "562", "421" },
                                                                 { "563", "422" }, { "564", "423" }, { "565", "424" },
                                                                 { "566", "425" }, { "567", "426" }, { "568", "427" },
                                                                 { "569", "428" }, { "570", "429" }, { "571", "430" },
                                                                 { "572", "431" }, { "573", "432" }, { "574", "433" },
                                                                 { "575", "434" }, { "576", "435" }, { "577", "436" },
                                                                 { "578", "437" }, { "652", "438" }, { "653", "439" },
                                                                 { "654", "440" }, { "655", "441" }, { "656", "442" },
                                                                 { "657", "443" }, { "658", "444" }, { "659", "445" },
                                                                 { "660", "446" }, { "661", "447" }, { "662", "448" },
                                                                 { "663", "449" }, { "664", "450" }, { "665", "451" },
                                                                 { "666", "452" }, { "667", "453" }, { "668", "454" },
                                                                 { "669", "455" }, { "670", "456" }, { "671", "457" },
                                                                 { "672", "458" }, { "673", "459" }, { "674", "460" },
                                                                 { "675", "461" }, { "676", "462" }, { "677", "463" },
                                                                 { "678", "464" }
                                                             };

    private Dictionary<string, string> ConvertDomInfoToQuery(int chargeType, int areaType, int subAreaType,
                                                             int floorCode, int domCode)
    {
        /*
         * 1. 芙蓉园、香樟园照明及空调，松林园、榕树园和银杏1栋、3栋照明，请通过“爱立得电费“通道充值；
         * 2. 珙桐园照明，请通过“珙桐园电费“通道充值；
         * 3. 银杏2栋和4栋照明及空调，榕树园、珙桐园、松林园、银杏1栋和3栋空调，请通过“新开普电费“通道充值；
         */
        var result = new Dictionary<string, string>();

        if ((areaType is 4 or 5) || (chargeType == 0 && areaType is 2 or 0) ||
            (chargeType == 0 && areaType == 3 && subAreaType is 0 or 2))
        {
            // 爱立得电费
            switch (areaType)
            {
                case 4: // 芙蓉园
                    result["areaid"] = "2";
                    result["buildid"] = (subAreaType + 1 + (chargeType == 0 ? 0 : 9)).ToString();
                    //result["roomid"] = 
                    return result;
                    break;
                case 3: // 银杏园
                    var domInFloor = domCode % 100;
                    if ((floorCode == 1 && domInFloor <= 50) ||
                        (floorCode == 2 && domInFloor <= 51) ||
                        (floorCode == 3 && domInFloor <= 51) ||
                        (floorCode == 4 && domInFloor <= 51) ||
                        (floorCode == 5 && domInFloor <= 51) ||
                        (floorCode == 6 && domInFloor <= 51))
                    {
                        // 银1 - 1
                        result["buildid"] = "1";
                    }
                    else
                    {
                        result["buildid"] = "2";
                    }

                    result["roomid"] = RoomIds.AldDomIdToRoomId["Y" + domCode];
                    return result;
            }
        }

        if (chargeType == 0 && areaType == 1)
        {
            // 珙桐园电费
        }

        if (areaType == 3 || (chargeType == 1 && areaType is 0 or 1 or 2))
        {
            // 新开普电费
            result["areaid"] = "99";
            int buildId = -1;
            int floorId = -1;
            if (areaType == 2)
            {
                // 松林
                buildId = (subAreaType + 20);
            }

            if (areaType == 3)
            {
                // 银杏
                buildId = (subAreaType + 9);
            }

            if (areaType == 1)
            {
                // 珙桐
                buildId = (subAreaType + 13);
                floorId = subAreaType * 6 + floorCode;
            }

            if (areaType == 0)
            {
                // 榕树 5 - 12
                buildId = (subAreaType + 1);
            }
        }

        throw new NotImplementedException();
    }

    private async Task AskAutoSelector()
    {
        var chargeTypeChoice = new SelectionPrompt<int>();
        chargeTypeChoice.Converter = s =>
        {
            return s switch
                   {
                       0 => "照明",
                       1 => "空调",
                       _ => "未知"
                   };
        };
        var chargeType = AnsiConsole.Prompt(chargeTypeChoice.Title("请选择你项目类型").AddChoices(0, 1));

        var areaTypeChoice = new SelectionPrompt<int>();
        areaTypeChoice.Converter = s =>
        {
            return s switch
                   {
                       0 => "榕树园",
                       1 => "珙桐园",
                       2 => "松林园",
                       3 => "银杏园",
                       4 => "芙蓉园",
                       5 => "香樟园",
                       _ => "未知"
                   };
        };
        var areaType = AnsiConsole.Prompt(areaTypeChoice.AddChoices(0, 1, 2, 3, 4, 5));

        var subAreaDictionary = _areasSubArea[areaType].ToDictionary(t => t.Value, t => t.Key);
        var subAreaTypeChoice = new SelectionPrompt<int>();

        subAreaTypeChoice.Converter = s => subAreaDictionary[s];
        var subAreaType = AnsiConsole.Prompt(subAreaTypeChoice.Title("请选择你的楼栋").AddChoices(subAreaDictionary.Keys));
        var floorNum = AnsiConsole.Ask<int>("请输入你的楼层");
        var domCode = AnsiConsole.Ask<int>("请输入你的完整寝室号, 数字");
        await AnsiConsole.Status().Spinner(Spinner.Known.Dots).StartAsync(
            "正在尝试智能转换到充值编号",
            async _ => { ConvertDomInfoToQuery(chargeType, areaType, subAreaType, floorNum, domCode); });
    }

    private async Task AskPayChoice()
    {
        var choice = new SelectionPrompt<int>();
        choice.Converter = s =>
        {
            return s switch
                   {
                       0 => "智能选择",
                       1 => "手动选择",
                       _ => "未知"
                   };
        };
        var selection = AnsiConsole.Prompt(choice.AddChoices(0, 1));
        switch (selection)
        {
            case 1:
                await AskOnlineProjectChoice();
                break;
            default:
                AnsiConsole.MarkupLine("正在使用智能充值选择工具");
                await AskAutoSelector();
                break;
        }
    }

    private async Task AskOnlineProjectChoice()
    {
        var choice = new SelectionPrompt<string>();
        choice.Converter = s => { return _projects?.First(t => t.Id == s).Name ?? "未知"; };
        var projectId = AnsiConsole.Prompt(choice.AddChoices(_projects?.Select(t => t.Id) ?? new List<string>()));
        switch (projectId)
        {
            case "7a99ede5475b55a03adb936454463994": // 新开普电费
                break;
        }
    }

    public async Task GetUserInfo()
    {
        await AnsiConsole.Status()
                         .Spinner(Spinner.Known.Dots)
                         .StartAsync("正在获取用户信息", async _ =>
                         {
                             var userInfo = await _paymServiceApi.GetUserInfo();
                             AnsiConsole.MarkupLine(
                                 $"欢迎 [green]{userInfo.Name}[/] ({userInfo.StudentId} [[{userInfo.Sex}]])");
                         });
    }

    public async Task GetAllProjects()
    {
        await AnsiConsole.Status()
                         .Spinner(Spinner.Known.Dots)
                         .StartAsync("正在获取可选项目信息", async _ =>
                         {
                             _projects = await _paymServiceApi.GetAllProjects();
                             AnsiConsole.MarkupLine($"获取成功, 共 [green]{_projects?.Count}[/] 个");
                         });
    }

    public async Task Authenticate()
    {
        await AnsiConsole.Status()
                         .AutoRefresh(true)
                         .StartAsync("正在尝试通过 Cas 系统认证 统一支付平台", async statusContext =>
                         {
                             statusContext.Spinner(Spinner.Known.Dots);
                             _authenticated = await _paymServiceApi.AuthenticateByCas();
                             if (!_authenticated)
                             {
                                 AnsiConsole.MarkupLine("[red]认证统一支付平台失败, 请尝试重新认证[/]");
                                 return;
                             }

                             AnsiConsole.MarkupLine("[green]认证统一支付平台成功[/]");
                         });
    }
}